app/controllers/simple_pages_controller.rb

  def admin

    @product = Product.find(1)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]