app/controllers/simple_pages_controller.rb

SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def landing_page
    @products = Product.all

SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def admin

    @product = Product.first